### Assignment 24 Feb

### Q1

#### 1. type ()

In [1]:
import pandas as pd

In [4]:
series_data = pd.Series([10,11,12,13,14,15])

In [5]:
type(series_data)

pandas.core.series.Series

#### 2. len()

In [10]:
len(series_data)

6

#### 3. describe()

In [14]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [18]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 4. head()

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### 5. info()

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Q2.

In [36]:
data = {
    'A' : [0,5,9,3,4],
    'B' : [3,8,6,2,9],
    'C' : [5,2,9,3,1]
}

In [37]:
df1 = pd.DataFrame(data)

In [38]:
df1

   A  B  C
0  0  3  5
1  5  8  2
2  9  6  9
3  3  2  3
4  4  9  1

In [83]:
def df_index_reset(df1):
    new_index = range(1, len(df1) * 2 + 1, 2)
    df_index = df1.reset_index(drop=True)
    df_index.index = new_index
    return df_index

In [87]:
reindex_data = df_index_reset(df1)

In [88]:
reindex_data

   A  B  C
1  0  3  5
3  5  8  2
5  9  6  9
7  3  2  3
9  4  9  1

### Q3

In [2]:
import pandas as pd

In [13]:
values =pd.DataFrame({'first':[10, 20, 30, 40, 50]})

In [14]:
values

   first
0     10
1     20
2     30
3     40
4     50

In [15]:
sum=0
for i in range(3):
    sum+=df['first'][i]

In [16]:
sum

60

### Q4.

In [57]:
df = pd.DataFrame({'Text': ['abcd ccd', 'efgh', 'hijk', 'lmno', 'pqrs', 'tuvw' , 'xyz']})

In [58]:
df['count'] = df['Text'].apply(lambda x : len(x))

In [59]:
df

       Text  count
0  abcd ccd      8
1      efgh      4
2      hijk      4
3      lmno      4
4      pqrs      4
5      tuvw      4
6       xyz      3

### Q5

#### size return the actual size of dataframe it will calculate the total no of rows and the total no of columns

In [41]:
df.size

14

#### shape return the total no of shape of a Dataframe it will calculate the how many no of rows and how many no of columns

In [42]:
df.shape

(7, 2)

### Q6

#### pd.read_excel() is used to read the excel file.

### Q7

In [60]:
df2 = pd.DataFrame({'Email' : ['abcd@gmail.com' , 'abcd1@gmail.com' , 'abcd2@gmail.com' , 'abcd3@gmail.com']})

In [61]:
df2

             Email
0   abcd@gmail.com
1  abcd1@gmail.com
2  abcd2@gmail.com
3  abcd3@gmail.com

In [63]:
li = []
for i in df2['Email']:
    splited_var = i.split('@')
    li.append(splited_var[0])

In [64]:
df2['username'] = li

In [65]:
df2

             Email username
0   abcd@gmail.com     abcd
1  abcd1@gmail.com    abcd1
2  abcd2@gmail.com    abcd2
3  abcd3@gmail.com    abcd3

### Q8

In [66]:
df3 = pd.DataFrame({'A' : [3,8,6,2,9], 'B': [5,2,9,3,1], 'C' : [1,7,4,5,2]})

In [67]:
def find_condition(df3):
    rows = df3[(df3['A'] > 5) & (df3['B'] < 10)]
    return rows

In [68]:
new_df = pd.DataFrame(find_condition(df3))

In [69]:
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9

In [5]:
df4 = pd.DataFrame({'Values' : [15, 25, 30, 26, 45, 10]} )

In [6]:
df4

   Values
0      15
1      25
2      30
3      26
4      45
5      10

In [7]:
def mean_median_mode(df4):
    mean = df4.mean()
    median = df4.median()
    mode = df4.std()
    return mean, median, mode

In [8]:
mean_median_mode(df4)

(Values    25.166667
 dtype: float64,
 Values    25.5
 dtype: float64,
 Values    12.254251
 dtype: float64)

### Q 10

In [76]:
df5 = {
    'sales' : [15000, 25000, 20000, 12000, 26000, 650000,],
    'date' : pd.date_range('2023-06-01' , periods=6)
}

In [78]:
df5 = pd.DataFrame(df5)

In [79]:
df5

    sales       date
0   15000 2023-06-01
1   25000 2023-06-02
2   20000 2023-06-03
3   12000 2023-06-04
4   26000 2023-06-05
5  650000 2023-06-06

In [84]:
def sumary(df5):
    df5['moving_array'] = df5['sales'].rolling(window = 7, min_periods = 1).mean()
    return df5

In [85]:
sumary(df5)

    sales       date   moning_array   moving_array
0   15000 2023-06-01   15000.000000   15000.000000
1   25000 2023-06-02   20000.000000   20000.000000
2   20000 2023-06-03   20000.000000   20000.000000
3   12000 2023-06-04   18000.000000   18000.000000
4   26000 2023-06-05   19600.000000   19600.000000
5  650000 2023-06-06  124666.666667  124666.666667

### Q 11

In [87]:
df6 = pd.DataFrame({'Date' : pd.date_range('2023-01-01', periods=5)})

In [88]:
df6

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [108]:
def fun(df6):
    df6['Weekday'] = df6['Date'].dt.day_name()
    return df6

In [109]:
fun(df6)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q 12

In [2]:
date = pd.date_range(start='2023-01-01', periods=35)

In [5]:
time = pd.Timedelta(days = 0, hours = 1, minutes= 10)

In [10]:
dff = pd.DataFrame({'Date & Time' : date + time})

In [17]:
def condition(dff):
    val = dff[(dff['Date & Time'] >= '2023-01-01') & (dff['Date & Time'] <= '2023-01-31')] 
    return val

In [18]:
condition(dff)

           Date & Time
0  2023-01-01 01:10:00
1  2023-01-02 01:10:00
2  2023-01-03 01:10:00
3  2023-01-04 01:10:00
4  2023-01-05 01:10:00
5  2023-01-06 01:10:00
6  2023-01-07 01:10:00
7  2023-01-08 01:10:00
8  2023-01-09 01:10:00
9  2023-01-10 01:10:00
10 2023-01-11 01:10:00
11 2023-01-12 01:10:00
12 2023-01-13 01:10:00
13 2023-01-14 01:10:00
14 2023-01-15 01:10:00
15 2023-01-16 01:10:00
16 2023-01-17 01:10:00
17 2023-01-18 01:10:00
18 2023-01-19 01:10:00
19 2023-01-20 01:10:00
20 2023-01-21 01:10:00
21 2023-01-22 01:10:00
22 2023-01-23 01:10:00
23 2023-01-24 01:10:00
24 2023-01-25 01:10:00
25 2023-01-26 01:10:00
26 2023-01-27 01:10:00
27 2023-01-28 01:10:00
28 2023-01-29 01:10:00
29 2023-01-30 01:10:00

### Q13

#### pandas 
#### import pandas as pd